embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/components/codec/cs42888/fsl_cs42888.c
/*
 * Copyright (c) 2017, NXP Semiconductors, Inc.
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_cs42888.h"
/*******************************************************************************
 * Definitations
 ******************************************************************************/
#define CLOCK_RATE_IN_RANGE(x, min, max) ((x > min) && (x < max))
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Set CS42888 reset function.
 *
 * @param handle CS42888 handle structure.
 * @param codecReset reset pin control function pointer.
 */
static void CS42888_Reset(cs42888_handle_t *handle, cs42888_reset codecReset);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
status_t CS42888_Init(cs42888_handle_t *handle, void *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    uint32_t i = 0;
    status_t errorStatus = kStatus_Success;

    /* Set CS42888 I2C address */
    handle->slaveAddress = CS42888_I2C_ADDR;

    /* reset codec firstly */
    CS42888_Reset(handle, ((cs42888_config_t *)config)->reset);

    /*PDN and PDN for each ADC and DAC are set as 1*/
    errorStatus = CS42888_WriteReg(handle, CS42888_POWER_CONTROL, 0x7F);

    /* NULL pointer means default setting. */
    if (config == NULL)
    {
        /*Register Configurations*/
        /* set as slave */
        CS42888_SetFuncMode(handle, kCS42888_ModeSlave);
        errorStatus = CS42888_SetProtocol(handle, kCS42888_BusLeftJustified, 16);
    }
    else
    {
        errorStatus = CS42888_ModifyReg(handle, CS42888_FUNCTIONAL_MODE, CS42888_FUNCTIONAL_MODE_DAC_FM_MASK,
                                        CS42888_FUNCTIONAL_MODE_DAC_FM(((cs42888_config_t *)config)->DACMode));
        errorStatus = CS42888_ModifyReg(handle, CS42888_FUNCTIONAL_MODE, CS42888_FUNCTIONAL_MODE_ADC_FM_MASK,
                                        CS42888_FUNCTIONAL_MODE_ADC_FM(((cs42888_config_t *)config)->ADCMode));
        errorStatus = CS42888_SetProtocol(handle, ((cs42888_config_t *)config)->bus, 16U);
    }
    /*Mute all DACs*/
    errorStatus = CS42888_WriteReg(handle, CS42888_CHANNEL_MUTE, 0xFF);

    /*Set PDN as 0*/
    errorStatus = CS42888_WriteReg(handle, CS42888_POWER_CONTROL, 0x0);
    errorStatus = CS42888_WriteReg(handle, CS42888_TRANSITION_CONTROL, 0x10);

    /* Configure the codec AIN volume to 8db */
    for (i = 0; i < 8; i++)
    {
        errorStatus = CS42888_SetAINVolume(handle, i, 16);
    }

    /*Delay and unmute*/
    errorStatus = CS42888_WriteReg(handle, CS42888_CHANNEL_MUTE, 0x0);

    return errorStatus;
}

void CS42888_SetFuncMode(cs42888_handle_t *handle, cs42888_func_mode mode)
{
    CS42888_ModifyReg(handle, CS42888_FUNCTIONAL_MODE, CS42888_FUNCTIONAL_MODE_DAC_FM_MASK,
                      CS42888_FUNCTIONAL_MODE_DAC_FM(mode));
    CS42888_ModifyReg(handle, CS42888_FUNCTIONAL_MODE, CS42888_FUNCTIONAL_MODE_ADC_FM_MASK,
                      CS42888_FUNCTIONAL_MODE_ADC_FM(mode));
}

static void CS42888_Reset(cs42888_handle_t *handle, cs42888_reset codecReset)
{
    assert(codecReset != NULL);

    /* hold reset 0 */
    codecReset(false);
    /* delay 400ms */
    handle->delayMs(400U);
    /* hold reset 0 */
    codecReset(true);
}

status_t CS42888_Deinit(cs42888_handle_t *handle)
{
    /* Disable all modules making CS42888 enter a low power mode */
    return CS42888_WriteReg(handle, CS42888_FUNCTIONAL_MODE, 0U);
}

status_t CS42888_SetProtocol(cs42888_handle_t *handle, cs42888_bus_t protocol, uint32_t bitWidth)
{
    uint8_t format = 0U;

    switch (protocol)
    {
        case kCS42888_BusLeftJustified:
            if (bitWidth <= 24U)
            {
                format = 0U;
                break;
            }
        case kCS42888_BusI2S:
            if (bitWidth <= 24U)
            {
                format = 0x09U;
                break;
            }
        case kCS42888_BusRightJustified:
            if (bitWidth == 24U)
            {
                format = 0x12U;
                break;
            }

            if (bitWidth == 16U)
            {
                format = 0x1BU;
                break;
            }
        case kCS42888_BusOL1:
            if (bitWidth == 20U)
            {
                format = 0x24U;
                break;
            }
        case kCS42888_BusOL2:
            if (bitWidth == 24U)
            {
                format = 0x2DU;
                break;
            }
        case kCS42888_BusTDM:
            if (bitWidth == 24U)
            {
                format = 0x36U;
                break;
            }

        default:
            return kStatus_Fail;
    }

    return CS42888_ModifyReg(handle, CS42888_INTERFACE_FORMATS, 0x3FU, format);
}

status_t CS42888_ConfigDataFormat(cs42888_handle_t *handle, uint32_t mclk, uint32_t sample_rate, uint32_t bits)
{
    status_t retval = kStatus_Success;

    uint8_t val = 0;
    uint32_t ratio = mclk / sample_rate;

    CS42888_ReadReg(handle, CS42888_FUNCTIONAL_MODE, &val);
    /* clear mfreq field */
    val &= ~0xEU;

    switch (ratio)
    {
        case 64:
            assert(CLOCK_RATE_IN_RANGE(sample_rate, 100000U, 200000U));
            assert(CLOCK_RATE_IN_RANGE(mclk, 1029000U, 12800000U));
            break;

        case 128:
            if (CLOCK_RATE_IN_RANGE(sample_rate, 100000U, 200000U) && CLOCK_RATE_IN_RANGE(mclk, 2048000U, 25600000U))
            {
                val |= 4U;
            }
            break;

        case 256:
            if (CLOCK_RATE_IN_RANGE(sample_rate, 50000U, 100000U) && CLOCK_RATE_IN_RANGE(mclk, 2048000U, 25600000U))
            {
                val |= 4U;
            }

            if (CLOCK_RATE_IN_RANGE(sample_rate, 100000U, 200000U) && CLOCK_RATE_IN_RANGE(mclk, 4096000U, 51200000U))
            {
                val |= 8U;
            }
            break;

        case 512:
            if (CLOCK_RATE_IN_RANGE(sample_rate, 4000U, 50000U) && CLOCK_RATE_IN_RANGE(mclk, 2048000U, 25600000U))
            {
                val |= 4U;
            }

            if (CLOCK_RATE_IN_RANGE(sample_rate, 50000U, 100000U) && CLOCK_RATE_IN_RANGE(mclk, 4096000U, 51200000U))
            {
                val |= 8U;
            }
            break;

        case 1024:
            assert(CLOCK_RATE_IN_RANGE(mclk, 4096000U, 51200000U));
            assert(CLOCK_RATE_IN_RANGE(sample_rate, 4000U, 50000U));
            val |= 8U;
            break;
    }

    retval = CS42888_WriteReg(handle, CS42888_FUNCTIONAL_MODE, val);

    return retval;
}

status_t CS42888_SetModule(cs42888_handle_t *handle, cs42888_module_t module, bool isEnabled)
{
    status_t ret = kStatus_Success;
    uint8_t val = 0;

    /* Read Power control register value */
    CS42888_ReadReg(handle, CS42888_POWER_CONTROL, &val);
    if (isEnabled)
    {
        val |= module;
    }
    else
    {
        val &= ~(uint32_t)module;
    }
    CS42888_WriteReg(handle, CS42888_POWER_CONTROL, val);
    return ret;
}

status_t CS42888_SetAOUTVolume(cs42888_handle_t *handle, uint8_t channel, uint8_t volume)
{
    status_t ret = kStatus_Success;
    uint8_t reg = CS42888_VOL_CONTROL_AOUT1 + (channel - 1U);

    if ((channel < 1) || (channel > 8))
    {
        ret = kStatus_Fail;
    }
    else
    {
        ret = CS42888_WriteReg(handle, reg, volume);
    }
    return ret;
}

status_t CS42888_SetAINVolume(cs42888_handle_t *handle, uint8_t channel, uint8_t volume)
{
    status_t ret = kStatus_Success;
    uint8_t reg = CS42888_VOL_CONTROL_AIN1 + (channel - 1U);

    if ((channel < 1) || (channel > 4))
    {
        ret = kStatus_Fail;
    }
    else
    {
        ret = CS42888_WriteReg(handle, reg, volume);
    }
    return ret;
}

uint8_t CS42888_GetAOUTVolume(cs42888_handle_t *handle, uint8_t channel)
{
    uint8_t val = 0;
    uint8_t reg = CS42888_VOL_CONTROL_AOUT1 + (channel - 1U);
    if ((channel < 1) || (channel > 8))
    {
        val = 0;
    }
    else
    {
        CS42888_ReadReg(handle, reg, &val);
    }
    return val;
}

uint8_t CS42888_GetAINVolume(cs42888_handle_t *handle, uint8_t channel)
{
    uint8_t val = 0;
    uint8_t reg = CS42888_VOL_CONTROL_AIN1 + (channel - 1U);
    if ((channel < 1) || (channel > 4))
    {
        val = 0;
    }
    else
    {
        CS42888_ReadReg(handle, reg, &val);
    }
    return val;
}

status_t CS42888_SetMute(cs42888_handle_t *handle, uint8_t channelMask)
{
    status_t ret = kStatus_Success;

    ret = CS42888_WriteReg(handle, CS42888_CHANNEL_MUTE, channelMask);
    return ret;
}

status_t CS42888_WriteReg(cs42888_handle_t *handle, uint8_t reg, uint8_t val)
{
    return handle->I2C_SendFunc(handle->slaveAddress, reg, 1U, &val, 1U);
}

status_t CS42888_ReadReg(cs42888_handle_t *handle, uint8_t reg, uint8_t *val)
{
    return handle->I2C_ReceiveFunc(handle->slaveAddress, reg, 1U, val, 1U);
}

status_t CS42888_ModifyReg(cs42888_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val)
{
    uint8_t reg_val = 0;

    if (CS42888_ReadReg(handle, reg, &reg_val) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    reg_val &= (uint8_t)~mask;
    reg_val |= val;

    return CS42888_WriteReg(handle, reg, reg_val);
}
